# Imports

In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data

# Exercises I

## 3

In [18]:
from env import host, user, password

In [19]:
def get_db_url(user,host,password,dbname):
	url = f'mysql+pymysql://{user}:{password}@{host}/{dbname}'
	return url

## 4

In [20]:
dbname='employees'
url=get_db_url(user,host,password,dbname)

In [21]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## 5

### a

In [22]:
dbname='employes'
url=get_db_url(user,host,password,dbname)

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'innis_1652'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### b

In [ ]:
pd.read_sql('SELECT * FROM employees LIMT 5 OFFSET 50', url)

(pymysql.err.OperationalError) (1044, "Access denied for user 'innis_1652'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## 6

In [34]:
dbname='employees'
url=get_db_url(user,host,password,dbname)
empolyees=pd.read_sql('SELECT * FROM employees', url)

In [35]:
empolyees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [36]:
dbname='employees'
url=get_db_url(user,host,password,dbname)
titles=pd.read_sql('SELECT * FROM titles', url)

In [37]:
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

## 7

In [38]:
empolyees.shape

(300024, 6)

In [39]:
titles.shape

(443308, 4)

## 8

In [50]:
empolyees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [49]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000


## 9

In [48]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

## 10

In [57]:
str(titles['to_date'].max())

'9999-01-01'

## 11

In [58]:
str(titles['to_date'].min())

'1985-03-01'